HaLoTaRiS/robot-biere-okdo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITDEBUG_UARTPINS_LED_BLUE_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_LED_BLUE_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_LED_BLUE_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_LED_BLUE_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_LED_BLUE_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO0_23 (number 20), P19[4]/ADC0_P
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_STEP_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_STEP_PIN 23U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_STEP_PIN_MASK (1U << 23U)
/* @} */

/*! @name PIO0_16 (number 14), P19[2]/P23[1]/ADC0_N
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_GPIO_PIN_MASK (1U << 16U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_PIN 16U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_ENABLE_PIN_MASK (1U << 16U)
/* @} */

/*! @name PIO0_15 (number 22), P18[11]/PIO0_15_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_GPIO_PIN_MASK (1U << 15U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_PIN 15U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_A_DIRECTION_PIN_MASK (1U << 15U)
/* @} */

/*! @name PIO1_27 (number 85), P17[16]/PLU_IN4/GPIO
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_STEP_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_STEP_PIN 27U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_STEP_PIN_MASK (1U << 27U)
/* @} */

/*! @name PIO1_26 (number 68), P18[18]/PLU_IN5/GPIO/SD1_WP
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_GPIO_PIN_MASK (1U << 26U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_PIN 26U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_MOTOR_B_DIRECTION_PIN_MASK (1U << 26U)
/* @} */

/*! @name PIO0_5 (number 88), S1/J10[1]/U3[12]/P17[8]/P7[7]/U11[4]/P0_5-ISP1
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_GPIO_PIN_MASK (1U << 5U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_PIN 5U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_1_PIN_MASK (1U << 5U)
/* @} */

/*! @name PIO1_9 (number 10), S3/P18[1]/PIO1_9_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_2_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_2_GPIO_PIN_MASK (1U << 9U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_2_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_2_PIN 9U
/*!
 * @brief PORT pin mask */
#define BOARD_INITDEBUG_UARTPINS_SWITCH_BOARD_2_PIN_MASK (1U << 9U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOCON_PIO_ASW_DI 0x00u        /*!<@brief Analog switch is open (disabled) */
#define IOCON_PIO_ASW_DIS_EN 0x00u    /*!<@brief Analog switch is closed (enabled), only for A0 version */
#define IOCON_PIO_ASW_EN 0x0400u      /*!<@brief Analog switch is closed (enabled) */
#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC6 0x06u         /*!<@brief Selects pin function 6 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLDOWN 0x10u /*!<@brief Selects pull-down function */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO0_11 (number 13), U14[4]/SWDCLK_TRGT
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PIN 11U
/*!
 * @brief PORT pin mask */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDCLK_PIN_MASK (1U << 11U)
/* @} */

/*! @name PIO0_12 (number 12), U15[4]/D7/P7[2]/IF_SWDIO
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PIN 12U
/*!
 * @brief PORT pin mask */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWDIO_PIN_MASK (1U << 12U)
/* @} */

/*! @name PIO0_10 (number 21), U14[12]/SWO_TRGT
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PIN 10U
/*!
 * @brief PORT pin mask */
#define BOARD_INITSWD_DEBUGPINS_DEBUG_SWD_SWO_PIN_MASK (1U << 10U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC4 0x04u         /*!<@brief Selects pin function 4 */
#define IOCON_PIO_FUNC7 0x07u         /*!<@brief Selects pin function 7 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

